benchmark/results/run-20260427-031037/microservices-run1-k6.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: k6/test.js
        output: -

     scenarios: (100.00%) 1 scenario, 200 max VUs, 2m0s max duration (incl. graceful stop):
              * default: Up to 200 looping VUs for 1m30s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m00.9s), 001/200 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 001/200 VUs  0m00.9s/1m30.0s

running (0m01.9s), 001/200 VUs, 1 complete and 0 interrupted iterations
default   [   2% ] 001/200 VUs  0m01.9s/1m30.0s

running (0m02.9s), 001/200 VUs, 2 complete and 0 interrupted iterations
default   [   3% ] 001/200 VUs  0m02.9s/1m30.0s

running (0m03.9s), 002/200 VUs, 3 complete and 0 interrupted iterations
default   [   4% ] 002/200 VUs  0m03.9s/1m30.0s

running (0m04.9s), 002/200 VUs, 5 complete and 0 interrupted iterations
default   [   5% ] 002/200 VUs  0m04.9s/1m30.0s

running (0m05.9s), 002/200 VUs, 7 complete and 0 interrupted iterations
default   [   7% ] 002/200 VUs  0m05.9s/1m30.0s

running (0m06.9s), 003/200 VUs, 9 complete and 0 interrupted iterations
default   [   8% ] 003/200 VUs  0m06.9s/1m30.0s

running (0m07.9s), 003/200 VUs, 12 complete and 0 interrupted iterations
default   [   9% ] 003/200 VUs  0m07.9s/1m30.0s

running (0m08.9s), 003/200 VUs, 15 complete and 0 interrupted iterations
default   [  10% ] 003/200 VUs  0m08.9s/1m30.0s

running (0m09.9s), 003/200 VUs, 18 complete and 0 interrupted iterations
default   [  11% ] 003/200 VUs  0m09.9s/1m30.0s

running (0m10.9s), 004/200 VUs, 21 complete and 0 interrupted iterations
default   [  12% ] 004/200 VUs  0m10.9s/1m30.0s

running (0m11.9s), 004/200 VUs, 25 complete and 0 interrupted iterations
default   [  13% ] 004/200 VUs  0m11.9s/1m30.0s

running (0m12.9s), 004/200 VUs, 29 complete and 0 interrupted iterations
default   [  14% ] 004/200 VUs  0m12.9s/1m30.0s

running (0m13.9s), 005/200 VUs, 33 complete and 0 interrupted iterations
default   [  15% ] 005/200 VUs  0m13.9s/1m30.0s

running (0m14.9s), 005/200 VUs, 38 complete and 0 interrupted iterations
default   [  17% ] 005/200 VUs  0m14.9s/1m30.0s

running (0m15.9s), 005/200 VUs, 43 complete and 0 interrupted iterations
default   [  18% ] 005/200 VUs  0m15.9s/1m30.0s

running (0m16.9s), 006/200 VUs, 47 complete and 0 interrupted iterations
default   [  19% ] 006/200 VUs  0m16.9s/1m30.0s

running (0m17.9s), 006/200 VUs, 53 complete and 0 interrupted iterations
default   [  20% ] 006/200 VUs  0m17.9s/1m30.0s

running (0m18.9s), 006/200 VUs, 59 complete and 0 interrupted iterations
default   [  21% ] 006/200 VUs  0m18.9s/1m30.0s

running (0m19.9s), 006/200 VUs, 65 complete and 0 interrupted iterations
default   [  22% ] 006/200 VUs  0m19.9s/1m30.0s

running (0m20.9s), 007/200 VUs, 71 complete and 0 interrupted iterations
default   [  23% ] 007/200 VUs  0m20.9s/1m30.0s

running (0m21.9s), 007/200 VUs, 78 complete and 0 interrupted iterations
default   [  24% ] 007/200 VUs  0m21.9s/1m30.0s

running (0m22.9s), 007/200 VUs, 85 complete and 0 interrupted iterations
default   [  25% ] 007/200 VUs  0m22.9s/1m30.0s

running (0m23.9s), 008/200 VUs, 92 complete and 0 interrupted iterations
default   [  27% ] 008/200 VUs  0m23.9s/1m30.0s

running (0m24.9s), 008/200 VUs, 100 complete and 0 interrupted iterations
default   [  28% ] 008/200 VUs  0m24.9s/1m30.0s

running (0m25.9s), 008/200 VUs, 108 complete and 0 interrupted iterations
default   [  29% ] 008/200 VUs  0m25.9s/1m30.0s

running (0m26.9s), 009/200 VUs, 116 complete and 0 interrupted iterations
default   [  30% ] 009/200 VUs  0m26.9s/1m30.0s

running (0m27.9s), 009/200 VUs, 125 complete and 0 interrupted iterations
default   [  31% ] 009/200 VUs  0m27.9s/1m30.0s

running (0m28.9s), 009/200 VUs, 134 complete and 0 interrupted iterations
default   [  32% ] 009/200 VUs  0m28.9s/1m30.0s

running (0m29.9s), 009/200 VUs, 143 complete and 0 interrupted iterations
default   [  33% ] 009/200 VUs  0m29.9s/1m30.0s

running (0m30.9s), 011/200 VUs, 152 complete and 0 interrupted iterations
default   [  34% ] 011/200 VUs  0m30.9s/1m30.0s

running (0m31.9s), 012/200 VUs, 163 complete and 0 interrupted iterations
default   [  35% ] 012/200 VUs  0m31.9s/1m30.0s

running (0m32.9s), 013/200 VUs, 175 complete and 0 interrupted iterations
default   [  37% ] 013/200 VUs  0m32.9s/1m30.0s

running (0m33.9s), 015/200 VUs, 188 complete and 0 interrupted iterations
default   [  38% ] 015/200 VUs  0m33.9s/1m30.0s

running (0m34.9s), 016/200 VUs, 203 complete and 0 interrupted iterations
default   [  39% ] 016/200 VUs  0m34.9s/1m30.0s

running (0m35.9s), 017/200 VUs, 219 complete and 0 interrupted iterations
default   [  40% ] 017/200 VUs  0m35.9s/1m30.0s

running (0m36.9s), 019/200 VUs, 236 complete and 0 interrupted iterations
default   [  41% ] 019/200 VUs  0m36.9s/1m30.0s

running (0m37.9s), 020/200 VUs, 255 complete and 0 interrupted iterations
default   [  42% ] 020/200 VUs  0m37.9s/1m30.0s

running (0m38.9s), 021/200 VUs, 275 complete and 0 interrupted iterations
default   [  43% ] 021/200 VUs  0m38.9s/1m30.0s

running (0m39.9s), 023/200 VUs, 295 complete and 0 interrupted iterations
default   [  44% ] 023/200 VUs  0m39.9s/1m30.0s

running (0m40.9s), 024/200 VUs, 318 complete and 0 interrupted iterations
default   [  45% ] 024/200 VUs  0m40.9s/1m30.0s

running (0m41.9s), 025/200 VUs, 342 complete and 0 interrupted iterations
default   [  47% ] 025/200 VUs  0m41.9s/1m30.0s

running (0m42.9s), 027/200 VUs, 367 complete and 0 interrupted iterations
default   [  48% ] 027/200 VUs  0m42.9s/1m30.0s

running (0m43.9s), 028/200 VUs, 394 complete and 0 interrupted iterations
default   [  49% ] 028/200 VUs  0m43.9s/1m30.0s

running (0m44.9s), 029/200 VUs, 422 complete and 0 interrupted iterations
default   [  50% ] 029/200 VUs  0m44.9s/1m30.0s

running (0m45.9s), 031/200 VUs, 451 complete and 0 interrupted iterations
default   [  51% ] 031/200 VUs  0m45.9s/1m30.0s

running (0m46.9s), 032/200 VUs, 482 complete and 0 interrupted iterations
default   [  52% ] 032/200 VUs  0m46.9s/1m30.0s

running (0m47.8s), 033/200 VUs, 514 complete and 0 interrupted iterations
default   [  53% ] 033/200 VUs  0m47.9s/1m30.0s

running (0m48.8s), 035/200 VUs, 547 complete and 0 interrupted iterations
default   [  54% ] 035/200 VUs  0m48.9s/1m30.0s

running (0m49.8s), 036/200 VUs, 581 complete and 0 interrupted iterations
default   [  55% ] 036/200 VUs  0m49.9s/1m30.0s

running (0m50.8s), 037/200 VUs, 616 complete and 0 interrupted iterations
default   [  57% ] 037/200 VUs  0m50.9s/1m30.0s

running (0m51.8s), 039/200 VUs, 651 complete and 0 interrupted iterations
default   [  58% ] 039/200 VUs  0m51.9s/1m30.0s

running (0m52.8s), 040/200 VUs, 690 complete and 0 interrupted iterations
default   [  59% ] 040/200 VUs  0m52.9s/1m30.0s

running (0m53.8s), 041/200 VUs, 730 complete and 0 interrupted iterations
default   [  60% ] 041/200 VUs  0m53.9s/1m30.0s

running (0m54.8s), 043/200 VUs, 758 complete and 0 interrupted iterations
default   [  61% ] 043/200 VUs  0m54.9s/1m30.0s

running (0m55.8s), 044/200 VUs, 799 complete and 0 interrupted iterations
default   [  62% ] 044/200 VUs  0m55.9s/1m30.0s

running (0m56.8s), 045/200 VUs, 843 complete and 0 interrupted iterations
default   [  63% ] 045/200 VUs  0m56.9s/1m30.0s

running (0m57.8s), 047/200 VUs, 885 complete and 0 interrupted iterations
default   [  64% ] 047/200 VUs  0m57.9s/1m30.0s

running (0m58.8s), 048/200 VUs, 932 complete and 0 interrupted iterations
default   [  65% ] 048/200 VUs  0m58.9s/1m30.0s

running (0m59.8s), 049/200 VUs, 980 complete and 0 interrupted iterations
default   [  67% ] 049/200 VUs  0m59.9s/1m30.0s

running (1m00.8s), 054/200 VUs, 1029 complete and 0 interrupted iterations
default   [  68% ] 054/200 VUs  1m00.9s/1m30.0s

running (1m01.8s), 059/200 VUs, 1081 complete and 0 interrupted iterations
default   [  69% ] 059/200 VUs  1m01.9s/1m30.0s

running (1m02.8s), 064/200 VUs, 1139 complete and 0 interrupted iterations
default   [  70% ] 064/200 VUs  1m02.9s/1m30.0s

running (1m03.8s), 069/200 VUs, 1203 complete and 0 interrupted iterations
default   [  71% ] 069/200 VUs  1m03.9s/1m30.0s

running (1m04.8s), 074/200 VUs, 1272 complete and 0 interrupted iterations
default   [  72% ] 074/200 VUs  1m04.9s/1m30.0s

running (1m05.8s), 079/200 VUs, 1345 complete and 0 interrupted iterations
default   [  73% ] 079/200 VUs  1m05.9s/1m30.0s

running (1m06.8s), 084/200 VUs, 1424 complete and 0 interrupted iterations
default   [  74% ] 084/200 VUs  1m06.9s/1m30.0s

running (1m07.8s), 089/200 VUs, 1505 complete and 0 interrupted iterations
default   [  75% ] 089/200 VUs  1m07.9s/1m30.0s

running (1m08.8s), 094/200 VUs, 1591 complete and 0 interrupted iterations
default   [  77% ] 094/200 VUs  1m08.9s/1m30.0s

running (1m09.8s), 099/200 VUs, 1685 complete and 0 interrupted iterations
default   [  78% ] 099/200 VUs  1m09.9s/1m30.0s

running (1m10.8s), 104/200 VUs, 1784 complete and 0 interrupted iterations
default   [  79% ] 104/200 VUs  1m10.9s/1m30.0s

running (1m11.8s), 109/200 VUs, 1888 complete and 0 interrupted iterations
default   [  80% ] 109/200 VUs  1m11.9s/1m30.0s

running (1m12.8s), 114/200 VUs, 1992 complete and 0 interrupted iterations
default   [  81% ] 114/200 VUs  1m12.9s/1m30.0s

running (1m13.8s), 119/200 VUs, 2106 complete and 0 interrupted iterations
default   [  82% ] 119/200 VUs  1m13.9s/1m30.0s

running (1m14.8s), 124/200 VUs, 2225 complete and 0 interrupted iterations
default   [  83% ] 124/200 VUs  1m14.9s/1m30.0s

running (1m15.8s), 129/200 VUs, 2349 complete and 0 interrupted iterations
default   [  84% ] 129/200 VUs  1m15.9s/1m30.0s

running (1m16.8s), 134/200 VUs, 2478 complete and 0 interrupted iterations
default   [  85% ] 134/200 VUs  1m16.9s/1m30.0s

running (1m17.8s), 139/200 VUs, 2611 complete and 0 interrupted iterations
default   [  87% ] 139/200 VUs  1m17.9s/1m30.0s

running (1m18.8s), 144/200 VUs, 2750 complete and 0 interrupted iterations
default   [  88% ] 144/200 VUs  1m18.9s/1m30.0s

running (1m19.8s), 149/200 VUs, 2894 complete and 0 interrupted iterations
default   [  89% ] 149/200 VUs  1m19.9s/1m30.0s

running (1m20.8s), 154/200 VUs, 3043 complete and 0 interrupted iterations
default   [  90% ] 154/200 VUs  1m20.9s/1m30.0s

running (1m21.8s), 159/200 VUs, 3187 complete and 0 interrupted iterations
default   [  91% ] 159/200 VUs  1m21.9s/1m30.0s

running (1m22.8s), 164/200 VUs, 3341 complete and 0 interrupted iterations
default   [  92% ] 164/200 VUs  1m22.9s/1m30.0s

running (1m23.8s), 169/200 VUs, 3505 complete and 0 interrupted iterations
default   [  93% ] 169/200 VUs  1m23.9s/1m30.0s

running (1m24.8s), 174/200 VUs, 3674 complete and 0 interrupted iterations
default   [  94% ] 174/200 VUs  1m24.9s/1m30.0s

running (1m25.8s), 179/200 VUs, 3841 complete and 0 interrupted iterations
default   [  95% ] 179/200 VUs  1m25.9s/1m30.0s

running (1m26.8s), 184/200 VUs, 4020 complete and 0 interrupted iterations
default   [  97% ] 184/200 VUs  1m26.9s/1m30.0s

running (1m27.8s), 189/200 VUs, 4203 complete and 0 interrupted iterations
default   [  98% ] 189/200 VUs  1m27.9s/1m30.0s

running (1m28.8s), 194/200 VUs, 4392 complete and 0 interrupted iterations
default   [  99% ] 194/200 VUs  1m28.9s/1m30.0s

running (1m29.8s), 199/200 VUs, 4586 complete and 0 interrupted iterations
default   [ 100% ] 199/200 VUs  1m29.9s/1m30.0s

running (1m30.8s), 000/200 VUs, 4785 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/200 VUs  1m30s


  █ TOTAL RESULTS 

    HTTP
    http_req_duration....: avg=4.54ms med=2.93ms min=22.13µs max=59.24ms p(90)=10.23ms p(95)=13.46ms p(99)=20.99ms
    http_req_failed......: 100.00% 19140 out of 19140
    http_reqs............: 19140   210.841588/s

    EXECUTION
    iteration_duration...: avg=1.01s  med=1.01s  min=1s      max=1.13s   p(90)=1.04s   p(95)=1.05s   p(99)=1.07s  
    iterations...........: 4785    52.710397/s
    vus..................: 199     min=1              max=199
    vus_max..............: 200     min=200            max=200

    NETWORK
    data_received........: 6.0 MB  66 kB/s
    data_sent............: 3.4 MB  38 kB/s



running (1m30.8s), 000/200 VUs, 4785 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/200 VUs  1m30s